Revit 2026 API

# CategoryNameMapErase Method

---

Removes a category with the specified name from the map.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual int Erase(
	string key
)
```
```vb
Public Overridable Function Erase (
	key As String
) As Integer
```
```cpp
public:
virtual int Erase(
	String^ key
)
```
```fsharp
abstract Erase :
        key : string -> int
override Erase :
        key : string -> int
```

#### Parameters

key String
    The name of the category to be erased.

#### Return Value

Int32The number of categories that were erased from the map.

#### Reference

CategoryNameMap Class

Autodesk.Revit.DB Namespace